Revit 2027 API
CurveByPoints.SetVisibility Method
Sets the visibility.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetVisibility(
	FamilyElementVisibility visibility
)
Public Sub SetVisibility (
	visibility As FamilyElementVisibility
)
public:
void SetVisibility(
	FamilyElementVisibility^ visibility
)
member SetVisibility :
        visibility : FamilyElementVisibility -> unit
Parameters
visibility FamilyElementVisibility
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when visibility is null.
InvalidOperationException |  Thrown when regeneration failed.
Remarks
The visibility of the CurveByPoints can be changed for different types of views and detail levels in the project.
See Also
Reference
CurveByPoints Class
Autodesk.Revit.DB Namespace